* FOXX6_thermistor1
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | FOXX6_thermistor1
Place name                       | Sermeq Avannerleq
Geographic location              | Central West Greenland
Site type                        | Ice sheet
Data Source                      | L체thi email
Data DOI                         | 
Science Source                   | Ryser, C., L체thi, M. P., Andrews, L. C., Hoffman, M. J., Catania, G. A., Hawley, R. L., ... & Kristensen, S. S. (2014). Sustained high basal motion of the Greenland ice sheet revealed by borehole deformation. Journal of Glaciology, 60(222), 647-660.
Science DOI                      | 10.3189/2014JoG13J196
Date                             | 2011-07-11
Longitude [째E]                   | -49.8851
Latitude [째N]                    | 69.4459
Location Source                  | 10.3189/2014JoG13J196
Depth of top measurement [m]     | 10.0
Depth of bottom measurement [m]  | 50
Ice thickness [m]                | 614
Coverage [% of thickness]        | 7
Ice thickness source             | Ryser, 2014 (Table 2)
Note                             | See FOXX1/temperature_foxx_gull_streamlined.org
#+end_example

** Temperature

See FOXX1/temperature_foxx_gull_streamlined.org

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|  d |        t |
| 10 |  -3.2035 |
| 15 | -3.50257 |
| 20 | -2.42688 |
| 25 | -1.78536 |
| 30 | -1.48265 |
| 35 | -1.31147 |
| 40 | -1.14017 |
| 45 |   -1.091 |
| 50 |   -1.173 |

